import React, { Component } from 'react';
import { Container } from 'react-bootstrap';

import Post from '../assets/img/blogpost.png';

import { showHomeHeader, showHomeFooter } from '../components/Home/HomeShow';

export default class BlogPost extends Component {
    render() {
        return (
            <>
                {showHomeHeader()}

                <div className="post__background"></div>

                <Container>
                    <div className="d-flex flex-column wrapper">
                        <div className="blog__title">
                            Хто такий QAOps і чим він займається?
                        </div>

                        <div className="post__text">
                            <p>
                                QAOps (quality assurance + software operations) — не нова спеціалізація. У різних компаніях вже досить давно використовують різні зв'язки термінів Test та OPS для опису цієї проєктної ролі: у Microsoft обрали назву TestOps, Google - TestSecOps, в ЕРАМ - DevTestSecOps.
                            </p>

                            <p>
                                Ці, на перший погляд, громіздкі терміни, насправді допомагають повноцінно зрозуміти, чим займаються фахівці з автоматизації тестування.
                            </p>

                            <p>
                                Адже їхнє коло обов'язків спочатку передбачає вміння не лише написати тест, а й інтегрувати його в існуючу інфраструктуру або створити нову, отримати необхідні дані, обробити та проаналізувати результати.
                            </p>

                            <p>
                                Набагато швидше зробити це самостійно, аніж залучати до процесу колег-розробників або DevOps-інженерів.
                            </p>

                            <p>
                                Примітно, що QAOps часто знаходять такий функціонал хмарних систем, про який не знають навіть DevOps. Ми — провокатори просунутого навчання.                             </p>

                            <p>
                                Адже їхнє коло обов'язків спочатку передбачає вміння не лише написати тест, а й інтегрувати його в існуючу інфраструктуру або створити нову, отримати необхідні дані, обробити та проаналізувати результати.
                            </p>

                            <div className="post__suptitle">
                                ЩО МАЄ ВМІТИ DEVTESTSECOPS?
                            </div>

                            <p>
                                DevTestSecOps — це універсальний солдат, який може з нуля розгорнути фреймворк, створити всю необхідну для тестування інфраструктуру, підтримувати автотести в робочому стані, у разі знайдених дефектів у програмному коді вміти їх виправити.
                            </p>

                            <p>
                                Це свого роду Full-Stack-інженери з фокусом на тестуванні програмного забезпечення, які, окрім своїх безпосередніх обов'язків, можуть виконувати низку інших завдань.
                            </p>

                            <p>
                                DevTestSecOps-спеціалістам (як і автоматизаторам тестування) досить важливо переглядати код розробників, щоб заздалегідь відстежити зміни в продукті, розуміти ті області, на які слід звернути увагу при тестуванні, та, як бонус, вдосконалювати власний стиль написання коду, навчаючись у розробників.
                            </p>

                            <div className="post__suptitle">
                                ВІД TEST AUTOMATION ENGINEER - ДО QAOPS
                            </div>

                            <p>
                                Помилкою було б вважати, що спеціалізація QAOps (quality assurance + software operations), яка поєднує в собі автоматизацію процесів тестування та задачі DevOps, є зовсім новою, адже хмарні обчислення з'явилися не вчора.
                            </p>

                            <p className="post__important">
                                Це може пролунати страшно для автоматизатора тестування – пофіксити знайдений дефект. Насправді ж, це дуже цікаво.
                            </p>

                            <p>
                                Залучаючись до процесу розробки з усіх сторін — ти розумієш продукт з усіх боків, тому розібратися в причині дефекту можливо за лічені хвилин. Ніби відкривається «третє око».
                            </p>

                            <div className="post__suptitle">
                                ЧОМУ DEVSECOPS ТАК ПОТРІБНІ НА ПРОЄКТАХ
                            </div>

                            <p>
                                У двох словах: клієнту вигідно мати у команді проєкту DevSecOps-фахівця, навіть незважаючи на те, що оплата його роботи, як правило, вища, ніж інженера з автоматизації тестування.
                            </p>

                            <p>
                                Такий фахівець, крім своїх прямих завдань із тестування програмного продукту, може частково брати на себе обов'язки DevOps-фахівців чи розробників, коли це критично необхідно. Наприклад, під час підготовки до релізу чи наявності пріоритетніших завдань для девелоперів.
                            </p>

                            <p>
                                У рамках проєкту для клієнта із сфери e-commerce команда роздробила велику систему на п'ять окремих підсистем. Навантаження було велике, тому в певний момент розробники почали вибиватися від запланового графіка.
                            </p>

                            <p>
                                Залучення в проєкт DevSecOps-фахівця дозволило звільнити девелоперів від рутинної роботи, що забирає багато часу, зокрема, ремонту регресійних дефектів, що надало їм можливість зосередитися на нарощуванні нових модулів. В результаті продуктивність роботи підвищилася у кілька разів.
                            </p>

                            <p>
                                Цікавим є приклад використання штучного інтелекту в роботі DevSecOps. Для одного з клієнтів, великої страхової компанії, було розроблено робот для прискорення обробки вхідної документації, що надходить у неоднорідному форматі. У результаті ми залучили цього робота для створення тестових даних для написання автотестів.
                            </p>

                            <div className="post__suptitle">
                                ЯК ОПАНУВАТИ ПРОФЕСІЮ ТА ЧОМУ ВАРТО ЦЕ РОБИТИ?
                            </div>

                            <p>
                                DevTestSecOps-спеціалістам набагато простіше спілкуватися і з розробниками, і з DevOps-інженерами, оскільки вони працюють з однаковими інструментами, використовують загальну професійну лексику.
                            </p>

                            <p>
                                Підвищення кваліфікації з інженера з автоматизації тестування до DevTestSecOps зазвичай відбувається або на практиці, «в полях», або шляхом самостійного освоєння інформації. Я – самоучка, мене мотивує моя «внутрішня дитина», яка постійно бажає все вивчати, пробувати та досліджувати. Але це далеко не показовий приклад.
                            </p>

                            <div className="post__important">
                                Middle QAOps
                            </div>

                            <p>
                                Найчастіше траєкторія навчання виглядає так: до рівня middle спеціаліст з автоматизації тестування прокачує ключові навички:
                            </p>

                            <p>
                                <ul className="post__ul">
                                    <li>вдосконалює майстерність написання тестів своєю основною мовою програмування; </li>
                                    <li>вивчає технології;</li>
                                    <li>навчається автоматизувати певні рівні додатків; </li>
                                    <li>накопичує знання та набуває практичного досвіду, який дозволяє швидко реагувати на запити клієнта, орієнтуватися у завданнях та шляхах їх вирішення. </li>
                                </ul>
                            </p>

                            <div className="post__important">
                                Senior QAOps
                            </div>

                            <p>
                                Починаючи з рівня senior, автоматизаторам встановлюють вимоги вищого порядку:
                            </p>

                            <p>
                                <ul className="post__ul">
                                    <li>вони відповідають за інфраструктуру; </li>
                                    <li>повинні вміти дописати скрипт для розширення можливостей cloud-провайдера; </li>
                                    <li>провести якісний код-рев'ю, оптимізувати ключові функції. </li>
                                </ul>
                            </p>

                            <p>
                                Знайти необхідну інформацію найчастіше допомагають DevOps-інженери або правильно сформульований запит у пошукових системах.
                            </p>

                            <p>
                                До речі, коректно сформулювати питання, для того, щоб Google видав потрібну відповідь — це теж навичок, яким далеко не всі володіють «за замовчуванням».
                            </p>

                            <div className="post__important">
                                На цьому ж рівні фахівець обирає наступний напрям розвитку: розвивати технічні компетенції або вибрати шлях у менеджмент.
                            </div>

                            <div className="post__suptitle">
                                DEVTESTSECOPS ≠ АВТОМАТИЗАТОР
                            </div>

                            <p>
                                У нашій професійній спільноті DevTestSecOps-фахівці уважно ставляться до правильного найменування їхньої позиції. Тому, якщо ви раптом назвете когось із них «тестувальником», можливо, вас і не видалять зі списку контактів, але неприємний осад залишиться.
                            </p>

                            <p>
                                Чому так важливо? У самій назві позиції закладено повне та правильне розуміння завдань, з якими працює спеціаліст. Тому надалі їм пропонуватимуть відповідні проєктні ролі та позиції.
                            </p>

                            <div className="w-100 text-center post__img">
                                <img className="w-50" src={Post} alt="post img" />
                            </div>

                            <div className="w-100 text-center post__video">
                                <iframe
                                    width="560"
                                    height="315"
                                    src="https://www.youtube.com/embed/dQw4w9WgXcQ"
                                    title="YouTube video player"
                                    frameborder="0"
                                    allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                                    allowfullscreen>
                                </iframe>
                            </div>
                        </div>
                    </div>
                </Container>

                {showHomeFooter()}
            </>
        );
    }
}
